
### :robot: Terraform Report
---
##### Plan: `14` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.base.module.hci.azurerm_key_vault.DeploymentKeyVault has changed
  ~ resource "azurerm_key_vault" "DeploymentKeyVault" {
        id                              = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg/providers/Microsoft.KeyVault/vaults/shjhaiac-kv-84"
        name                            = "shjhaiac-kv-84"
      + tags                            = {}
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.base.module.aks-arc.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.base.module.aks-arc.azapi_resource.connectedCluster will be created
  + resource "azapi_resource" "connectedCluster" {
      + body                      = {
          + kind       = "ProvisionedCluster"
          + properties = {
              + aadProfile                = {
                  + adminGroupObjectIDs = [
                      + "2a429c24-2aed-455b-974e-6d6710da8f7e",
                    ]
                  + enableAzureRBAC     = true
                  + tenantID            = (known after apply)
                }
              + agentPublicKeyCertificate = ""
              + azureHybridBenefit        = null
              + distribution              = null
              + infrastructure            = null
              + privateLinkState          = null
              + provisioningState         = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus"
      + name                      = "shjhaiac-aksArc"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg"
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.Kubernetes/connectedClusters@2024-01-01"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.base.module.aks-arc.azapi_resource.provisionedClusterInstance will be created
  + resource "azapi_resource" "provisionedClusterInstance" {
      + body                      = {
          + extendedLocation = {
              + name = (known after apply)
              + type = "CustomLocation"
            }
          + properties       = {
              + agentPoolProfiles      = [
                  + {
                      + count             = 1
                      + enableAutoScaling = false
                      + osSKU             = "CBLMariner"
                      + osType            = "Linux"
                      + vmSize            = "Standard_A4_v2"
                    },
                ]
              + cloudProviderProfile   = {
                  + infraNetworkProfile = {
                      + vnetSubnetIds = [
                          + (known after apply),
                        ]
                    }
                }
              + clusterVMAccessProfile = {}
              + controlPlane           = {
                  + controlPlaneEndpoint = {
                      + hostIP = "192.168.1.190"
                    }
                  + count                = 1
                  + vmSize               = "Standard_A4_v2"
                }
              + kubernetesVersion      = "1.28.5"
              + licenseProfile         = {
                  + azureHybridBenefit = "False"
                }
              + linuxProfile           = {
                  + ssh = {
                      + publicKeys = [
                          + {
                              + keyData = (known after apply)
                            },
                        ]
                    }
                }
              + networkProfile         = {
                  + loadBalancerProfile = {}
                  + networkPolicy       = "calico"
                  + podCidr             = "10.244.0.0/16"
                }
              + storageProfile         = {
                  + nfsCsiDriver = {
                      + enabled = true
                    }
                  + smbCsiDriver = {
                      + enabled = true
                    }
                }
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "default"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.HybridContainerService/provisionedClusterInstances@2024-01-01"
    }

  # module.base.module.aks-arc.azurerm_key_vault_secret.sshPrivateKeyPem[0] will be created
  + resource "azurerm_key_vault_secret" "sshPrivateKeyPem" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg/providers/Microsoft.KeyVault/vaults/shjhaiac-kv-84"
      + name                    = "AksArcAgentSshPrivateKeyPem"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.base.module.aks-arc.azurerm_key_vault_secret.sshPublicKey[0] will be created
  + resource "azurerm_key_vault_secret" "sshPublicKey" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg/providers/Microsoft.KeyVault/vaults/shjhaiac-kv-84"
      + name                    = "AksArcAgentSshPublicKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.base.module.aks-arc.terraform_data.replacement[0] will be created
  + resource "terraform_data" "replacement" {
      + id     = (known after apply)
      + input  = "shjhaiac-rg"
      + output = (known after apply)
    }

  # module.base.module.aks-arc.terraform_data.waitAksVhdReady[0] will be created
  + resource "terraform_data" "waitAksVhdReady" {
      + id = (known after apply)
    }

  # module.base.module.aks-arc.tls_private_key.rsaKey[0] will be created
  + resource "tls_private_key" "rsaKey" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.base.module.hci.data.azapi_resource.arcSettings will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azapi_resource" "arcSettings" {
      + id          = (known after apply)
      + identity    = (known after apply)
      + location    = (known after apply)
      + name        = "default"
      + output      = (known after apply)
      + parent_id   = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg/providers/Microsoft.AzureStackHCI/clusters/shjhaiac-cl"
      + resource_id = (known after apply)
      + tags        = (known after apply)
      + type        = "Microsoft.AzureStackHCI/clusters/ArcSettings@2023-08-01"
    }

  # module.base.module.hci.data.azapi_resource.arcbridge will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azapi_resource" "arcbridge" {
      + id          = (known after apply)
      + identity    = (known after apply)
      + location    = (known after apply)
      + name        = "shjhaiac-cl-arcbridge"
      + output      = (known after apply)
      + parent_id   = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg"
      + resource_id = (known after apply)
      + tags        = (known after apply)
      + type        = "Microsoft.ResourceConnector/appliances@2022-10-27"
    }

  # module.base.module.hci.data.azapi_resource.customlocation will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azapi_resource" "customlocation" {
      + id          = (known after apply)
      + identity    = (known after apply)
      + location    = (known after apply)
      + name        = "shjhaiac-customlocation"
      + output      = (known after apply)
      + parent_id   = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg"
      + resource_id = (known after apply)
      + tags        = (known after apply)
      + type        = "Microsoft.ExtendedLocation/customLocations@2021-08-15"
    }

  # module.base.module.hci.data.azapi_resource_list.userStorages will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azapi_resource_list" "userStorages" {
      + id                     = (known after apply)
      + output                 = (known after apply)
      + parent_id              = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg"
      + response_export_values = [
          + "*",
        ]
      + type                   = "Microsoft.AzureStackHCI/storagecontainers@2022-12-15-preview"
    }

  # module.base.module.hci.azapi_resource.validatedeploymentsetting_seperate[0] is tainted, so must be replaced
-/+ resource "azapi_resource" "validatedeploymentsetting_seperate" {
      ~ body                      = {
          ~ properties = {
              ~ deploymentConfiguration = {
                  ~ scaleUnits = [
                      ~ {
                          ~ deploymentData = {
                              ~ hostNetwork           = {
                                  ~ intents                       = [
                                      ~ {
                                          ~ adapter                             = [
                                              ~ "FACBRIC" -> "FABRIC",
                                                "FABRIC2",
                                            ]
                                            name                                = "ManagementCompute"
                                            # (7 unchanged attributes hidden)
                                        },
                                        {
                                            adapter                             = [
                                                "StorageA",
                                                "StorageB",
                                            ]
                                            adapterPropertyOverrides            = {
                                                jumboPacket             = ""
                                                networkDirect           = "Disabled"
                                                networkDirectTechnology = ""
                                            }
                                            name                                = "Storage"
                                            overrideAdapterProperty             = true
                                            overrideQosPolicy                   = false
                                            overrideVirtualSwitchConfiguration  = false
                                            qosPolicyOverrides                  = {
                                                bandwidthPercentage_SMB         = ""
                                                priorityValue8021Action_Cluster = ""
                                                priorityValue8021Action_SMB     = ""
                                            }
                                            trafficType                         = [
                                                "Storage",
                                            ]
                                            virtualSwitchConfigurationOverrides = {
                                                enableIov              = ""
                                                loadBalancingAlgorithm = ""
                                            }
                                        },
                                    ]
                                    # (3 unchanged attributes hidden)
                                }
                                # (11 unchanged attributes hidden)
                            }
                        },
                    ]
                    # (1 unchanged attribute hidden)
                }
                # (2 unchanged attributes hidden)
            }
        }
      ~ id                        = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg/providers/Microsoft.AzureStackHCI/clusters/shjhaiac-cl/deploymentSettings/default" -> (known after apply)
        name                      = "default"
      ~ output                    = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.base.module.hci.azapi_update_resource.deploymentsetting[0] will be created
  + resource "azapi_update_resource" "deploymentsetting" {
      + body                    = {
          + properties = {
              + deploymentMode = "Deploy"
            }
        }
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "default"
      + output                  = (known after apply)
      + parent_id               = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg/providers/Microsoft.AzureStackHCI/clusters/shjhaiac-cl"
      + resource_id             = (known after apply)
      + type                    = "Microsoft.AzureStackHCI/clusters/deploymentSettings@2023-08-01-preview"

      + timeouts {
          + create = "24h"
          + delete = "60m"
        }
    }

  # module.base.module.logical-network.azapi_resource.logicalNetwork will be created
  + resource "azapi_resource" "logicalNetwork" {
      + body                      = {
          + extendedLocation = {
              + name = (known after apply)
              + type = "CustomLocation"
            }
          + properties       = {
              + dhcpOptions  = {
                  + dnsServers = [
                      + "192.168.1.254",
                    ]
                }
              + subnets      = [
                  + {
                      + name       = "default"
                      + properties = {
                          + addressPrefix      = "192.168.1.0/24"
                          + ipAllocationMethod = "Static"
                          + ipPools            = [
                              + {
                                  + end   = "192.168.1.190"
                                  + info  = {}
                                  + start = "192.168.1.171"
                                },
                            ]
                          + routeTable         = {
                              + properties = {
                                  + routes = [
                                      + {
                                          + name       = "default"
                                          + properties = {
                                              + addressPrefix    = "0.0.0.0/0"
                                              + nextHopIpAddress = "192.168.1.1"
                                            }
                                        },
                                    ]
                                }
                            }
                        }
                    },
                ]
              + vmSwitchName = "ConvergedSwitch(managementcompute)"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus"
      + name                      = "shjhaiac-logicalnetwork"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg"
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.AzureStackHCI/logicalNetworks@2023-09-01-preview"
    }

  # module.base.module.vm[0].azapi_resource.hybrid_compute_machine will be created
  + resource "azapi_resource" "hybrid_compute_machine" {
      + body                      = {
          + kind = "HCI"
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus"
      + name                      = "shjhaiac-vm"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg"
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + type                      = "Microsoft.HybridCompute/machines@2023-10-03-preview"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.base.module.vm[0].azapi_resource.nic will be created
  + resource "azapi_resource" "nic" {
      + body                      = {
          + extendedLocation = {
              + name = (known after apply)
              + type = "CustomLocation"
            }
          + properties       = {
              + ipConfigurations = [
                  + {
                      + name       = null
                      + properties = {
                          + privateIPAddress = null
                          + subnet           = {
                              + id = (known after apply)
                            }
                        }
                    },
                ]
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus"
      + name                      = "shjhaiac-vm-nic"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg"
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.AzureStackHCI/networkInterfaces@2023-09-01-preview"
    }

  # module.base.module.vm[0].azapi_resource.virtual_machine will be created
  + resource "azapi_resource" "virtual_machine" {
      + body                      = {
          + extendedLocation = {
              + name = (known after apply)
              + type = "CustomLocation"
            }
          + properties       = {
              + hardwareProfile = {
                  + dynamicMemoryConfig = {
                      + maximumMemoryMB    = 8192
                      + minimumMemoryMB    = 512
                      + targetMemoryBuffer = 20
                    }
                  + memoryMB            = 8192
                  + processors          = 2
                  + vmSize              = "Custom"
                }
              + networkProfile  = {
                  + networkInterfaces = [
                      + {
                          + id = (known after apply)
                        },
                    ]
                }
              + osProfile       = {
                  + adminPassword        = (sensitive value)
                  + adminUsername        = "shjhaiacadmin"
                  + computerName         = "shjhaiac-vm"
                  + windowsConfiguration = {
                      + provisionVMAgent       = true
                      + provisionVMConfigAgent = true
                    }
                }
              + storageProfile  = {
                  + dataDisks             = []
                  + imageReference        = {
                      + id = (known after apply)
                    }
                  + vmConfigStoragePathId = null
                }
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "default"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.AzureStackHCI/virtualMachineInstances@2023-09-01-preview"

      + timeouts {
          + create = "2h"
        }
    }

  # module.base.module.vm-image.azapi_resource.winServerImage[0] will be created
  + resource "azapi_resource" "winServerImage" {
      + body                      = {
          + extendedLocation = {
              + name = (known after apply)
              + type = "CustomLocation"
            }
          + properties       = {
              + containerId      = null
              + hyperVGeneration = "V2"
              + identifier       = {
                  + offer     = "WindowsServer"
                  + publisher = "MicrosoftWindowsServer"
                  + sku       = "2022-datacenter-azure-edition"
                }
              + osType           = "Windows"
              + version          = {
                  + name       = "20348.2113.231109"
                  + properties = {
                      + storageProfile = {
                          + osDiskImage = {}
                        }
                    }
                }
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus"
      + name                      = "winServer2022-01"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg"
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.AzureStackHCI/marketplaceGalleryImages@2023-09-01-preview"

      + timeouts {
          + create = "24h"
          + delete = "60m"
        }
    }

Plan: 14 to add, 0 to change, 1 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#11296548397`](https://github.com/2sjha/arciac/actions/runs/11296548397) - commit a104c6e52ea7cdfcc7ca8ee5eba8088608aa124a
